---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.MEPAnalyticalNode
source: html/64d2c774-2ccc-ff8c-559d-a56572e54bbf.htm
---
# MEPAnalyticalNode Methods

Verify if this node is connected to the other node and thus represents the same analytical node in the network.